bluestore/fourjobs/write-4k.out
ceph-fuse-replicated: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
ceph-fuse-erasure_1: (g=1): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
ceph-fuse-erasure_2: (g=2): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
ceph-kern-replicated: (g=3): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
ceph-kern-erasure_1: (g=4): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
ceph-kern-erasure_2: (g=5): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.16
Starting 24 processes

ceph-fuse-replicated: (groupid=0, jobs=4): err= 0: pid=9029: Wed Feb 28 13:42:52 2018
  write: io=226116KB, bw=3768.5KB/s, iops=942, runt= 60003msec
    slat (msec): min=2, max=482, avg= 4.23, stdev=13.24
    clat (usec): min=12, max=652703, avg=131474.04, stdev=72868.00
     lat (msec): min=2, max=656, avg=135.71, stdev=73.99
    clat percentiles (msec):
     |  1.00th=[   97],  5.00th=[  100], 10.00th=[  102], 20.00th=[  104],
     | 30.00th=[  108], 40.00th=[  110], 50.00th=[  112], 60.00th=[  115],
     | 70.00th=[  119], 80.00th=[  126], 90.00th=[  139], 95.00th=[  285],
     | 99.00th=[  529], 99.50th=[  570], 99.90th=[  594], 99.95th=[  603],
     | 99.99th=[  652]
    bw (KB  /s): min=   10, max=  841, per=16.95%, avg=638.62, stdev=186.51
    lat (usec) : 20=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.02%, 50=0.06%, 100=5.06%
    lat (msec) : 250=88.49%, 500=5.01%, 750=1.32%
  cpu          : usr=0.61%, sys=1.61%, ctx=113150, majf=0, minf=85
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=56529/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-fuse-erasure_1: (groupid=1, jobs=4): err= 0: pid=9115: Wed Feb 28 13:42:52 2018
  write: io=34164KB, bw=577922B/s, iops=141, runt= 60534msec
    slat (msec): min=3, max=2936, avg=28.21, stdev=89.16
    clat (usec): min=14, max=7449.6K, avg=870308.51, stdev=725072.23
     lat (msec): min=20, max=7488, avg=898.52, stdev=741.86
    clat percentiles (msec):
     |  1.00th=[  297],  5.00th=[  351], 10.00th=[  383], 20.00th=[  445],
     | 30.00th=[  523], 40.00th=[  594], 50.00th=[  685], 60.00th=[  783],
     | 70.00th=[  938], 80.00th=[ 1205], 90.00th=[ 1434], 95.00th=[ 1663],
     | 99.00th=[ 5014], 99.50th=[ 6128], 99.90th=[ 6718], 99.95th=[ 7373],
     | 99.99th=[ 7439]
    bw (KB  /s): min=   12, max=  331, per=23.10%, avg=130.28, stdev=73.22
    lat (usec) : 20=0.04%, 50=0.01%
    lat (msec) : 50=0.05%, 100=0.05%, 250=0.16%, 500=26.77%, 750=29.15%
    lat (msec) : 1000=16.87%, 2000=24.04%, >=2000=2.87%
  cpu          : usr=0.11%, sys=0.30%, ctx=17112, majf=0, minf=80
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.4%, 16=0.7%, 32=98.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=8541/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-fuse-erasure_2: (groupid=2, jobs=4): err= 0: pid=9216: Wed Feb 28 13:42:52 2018
  write: io=34112KB, bw=581867B/s, iops=142, runt= 60032msec
    slat (msec): min=3, max=835, avg=28.13, stdev=54.04
    clat (usec): min=9, max=3503.8K, avg=867363.19, stdev=407296.22
     lat (msec): min=5, max=3521, avg=895.49, stdev=413.91
    clat percentiles (msec):
     |  1.00th=[  334],  5.00th=[  429], 10.00th=[  482], 20.00th=[  562],
     | 30.00th=[  619], 40.00th=[  676], 50.00th=[  758], 60.00th=[  857],
     | 70.00th=[  971], 80.00th=[ 1156], 90.00th=[ 1369], 95.00th=[ 1614],
     | 99.00th=[ 2409], 99.50th=[ 2507], 99.90th=[ 3458], 99.95th=[ 3490],
     | 99.99th=[ 3490]
    bw (KB  /s): min=   15, max=  346, per=26.70%, avg=151.67, stdev=77.02
    lat (usec) : 10=0.01%, 20=0.04%
    lat (msec) : 10=0.02%, 20=0.02%, 50=0.09%, 100=0.16%, 250=0.43%
    lat (msec) : 500=11.47%, 750=36.82%, 1000=23.19%, 2000=25.68%, >=2000=2.05%
  cpu          : usr=0.12%, sys=0.29%, ctx=17081, majf=0, minf=85
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.4%, 16=0.8%, 32=98.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=8528/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-replicated: (groupid=3, jobs=4): err= 0: pid=9287: Wed Feb 28 13:42:52 2018
  write: io=872160KB, bw=14519KB/s, iops=3629, runt= 60071msec
    slat (usec): min=13, max=355495, avg=122.80, stdev=1524.40
    clat (msec): min=1, max=1053, avg=34.93, stdev=56.68
     lat (msec): min=1, max=1053, avg=35.05, stdev=56.70
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[   11], 10.00th=[   14], 20.00th=[   18],
     | 30.00th=[   22], 40.00th=[   25], 50.00th=[   28], 60.00th=[   30],
     | 70.00th=[   34], 80.00th=[   38], 90.00th=[   48], 95.00th=[   67],
     | 99.00th=[  200], 99.50th=[  359], 99.90th=[  865], 99.95th=[ 1045],
     | 99.99th=[ 1057]
    bw (KB  /s): min=    9, max= 5541, per=15.21%, avg=2207.93, stdev=828.79
    lat (msec) : 2=0.02%, 4=0.20%, 10=4.09%, 20=22.00%, 50=65.08%
    lat (msec) : 100=5.84%, 250=1.98%, 500=0.38%, 750=0.17%, 1000=0.18%
    lat (msec) : 2000=0.06%
  cpu          : usr=0.90%, sys=6.08%, ctx=223798, majf=0, minf=83
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=218040/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_1: (groupid=4, jobs=4): err= 0: pid=9385: Wed Feb 28 13:42:52 2018
  write: io=60036KB, bw=995.62KB/s, iops=248, runt= 60301msec
    slat (usec): min=17, max=115366, avg=133.80, stdev=1877.81
    clat (msec): min=11, max=6229, avg=512.98, stdev=697.71
     lat (msec): min=11, max=6229, avg=513.11, stdev=697.70
    clat percentiles (msec):
     |  1.00th=[   47],  5.00th=[   64], 10.00th=[   83], 20.00th=[  110],
     | 30.00th=[  147], 40.00th=[  200], 50.00th=[  260], 60.00th=[  338],
     | 70.00th=[  465], 80.00th=[  701], 90.00th=[ 1303], 95.00th=[ 1844],
     | 99.00th=[ 3490], 99.50th=[ 4359], 99.90th=[ 5276], 99.95th=[ 6194],
     | 99.99th=[ 6259]
    bw (KB  /s): min=   13, max= 2072, per=37.27%, avg=370.87, stdev=308.18
    lat (msec) : 20=0.09%, 50=1.49%, 100=15.00%, 250=32.24%, 500=23.47%
    lat (msec) : 750=8.87%, 1000=4.43%, 2000=10.42%, >=2000=3.98%
  cpu          : usr=0.07%, sys=0.35%, ctx=12975, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=99.2%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=15009/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_2: (groupid=5, jobs=4): err= 0: pid=9443: Wed Feb 28 13:42:52 2018
  write: io=57088KB, bw=970774B/s, iops=237, runt= 60218msec
    slat (usec): min=22, max=314645, avg=208.26, stdev=5248.07
    clat (msec): min=10, max=2899, avg=536.96, stdev=520.91
     lat (msec): min=11, max=2900, avg=537.17, stdev=521.00
    clat percentiles (msec):
     |  1.00th=[   43],  5.00th=[   81], 10.00th=[  104], 20.00th=[  139],
     | 30.00th=[  172], 40.00th=[  239], 50.00th=[  334], 60.00th=[  486],
     | 70.00th=[  644], 80.00th=[  840], 90.00th=[ 1319], 95.00th=[ 1647],
     | 99.00th=[ 2278], 99.50th=[ 2442], 99.90th=[ 2671], 99.95th=[ 2671],
     | 99.99th=[ 2900]
    bw (KB  /s): min=   16, max= 2992, per=36.39%, avg=344.97, stdev=318.91
    lat (msec) : 20=0.06%, 50=1.37%, 100=7.78%, 250=32.93%, 500=19.20%
    lat (msec) : 750=15.51%, 1000=7.05%, 2000=13.99%, >=2000=2.12%
  cpu          : usr=0.05%, sys=0.43%, ctx=13011, majf=0, minf=79
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=99.1%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=14272/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=226116KB, aggrb=3768KB/s, minb=3768KB/s, maxb=3768KB/s, mint=60003msec, maxt=60003msec

Run status group 1 (all jobs):
  WRITE: io=34164KB, aggrb=564KB/s, minb=564KB/s, maxb=564KB/s, mint=60534msec, maxt=60534msec

Run status group 2 (all jobs):
  WRITE: io=34112KB, aggrb=568KB/s, minb=568KB/s, maxb=568KB/s, mint=60032msec, maxt=60032msec

Run status group 3 (all jobs):
  WRITE: io=872160KB, aggrb=14518KB/s, minb=14518KB/s, maxb=14518KB/s, mint=60071msec, maxt=60071msec

Run status group 4 (all jobs):
  WRITE: io=60036KB, aggrb=995KB/s, minb=995KB/s, maxb=995KB/s, mint=60301msec, maxt=60301msec

Run status group 5 (all jobs):
  WRITE: io=57088KB, aggrb=948KB/s, minb=948KB/s, maxb=948KB/s, mint=60218msec, maxt=60218msec